[
  "obsidian-admonition",
  "obsidian-dice-roller",
  "obsidian-5e-statblocks",
  "initiative-tracker",
  "obsidian-leaflet-plugin",
  "table-editor-obsidian",
  "dataview",
  "obsidian-style-settings",
  "dbfolder",
  "metaedit"
]