{
  "metadata": {
    "version": "1.0",
    "lastUpdated": "2024-11-05",
    "description": "Contextual help topics for the Undercroft Workbench suite, Press, and future tools."
  },
  "topics": [
    {
      "id": "workspace.overview",
      "title": "Shared Workspace Layout",
      "summary": "Each tool uses the same tri-pane layout with collapsible navigation, canvas, and utilities panes.",
      "details": [
        "The left pane exposes navigation, palettes, and recent records. Use the sidebar toggle or the \"Layout\" button in the header to show or hide it.",
        "The center canvas adjusts to the active tool: system schema trees, template layout boards, or interactive character sheets.",
        "The right pane hosts inspectors, metadata, and contextual utilities such as JSON previews or collaboration panels."],
      "category": "Workbench Fundamentals",
      "href": "docs/index.html#workspace-overview"
    },
    {
      "id": "workspace.theme",
      "title": "Theme & Accessibility Controls",
      "summary": "Switch between light, dark, and system themes without reloading the page.",
      "details": [
        "The theme buttons in the header persist your preference in local storage under the `undercroft.workbench.theme` key.",
        "System theme uses the browser's `prefers-color-scheme` media query. All panes recompute colors immediately when toggled.",
        "Bootstrap tooltips and icons inherit the active theme for consistent contrast."],
      "category": "Workbench Fundamentals",
      "href": "docs/index.html#workspace-theme"
    },
    {
      "id": "workspace.undo",
      "title": "Undo, Redo, & Keyboard Shortcuts",
      "summary": "Undo/redo stacks persist per tool and mirror standard editor shortcuts.",
      "details": [
        "Each page registers a namespaced undo stack capped by the optional limit set in the app shell.",
        "Use Ctrl+Z / Cmd+Z to undo and Ctrl+Shift+Z / Cmd+Shift+Z to redo. Buttons in toolbars mirror the same behaviour.",
        "Undo history is serialised to local storage so reloading restores the last working state, even when offline."],
      "category": "Workbench Fundamentals",
      "href": "docs/index.html#workspace-undo"
    },
    {
      "id": "system.palette",
      "title": "System Field Palette",
      "summary": "Drag fields from the palette to add them to the active system schema.",
      "details": [
        "Palette entries mirror the canonical schema types defined in `TYPE_DEFS` and include icons, descriptions, and drag handles.",
        "Dropping a field onto the canvas assigns a stable node id and queues an undo entry so the action can be reverted.",
        "Numeric fields expose additional constraints (min, max, step) once selected in the inspector."],
      "category": "System Editor",
      "href": "docs/index.html#system-palette"
    },
    {
      "id": "system.inspector",
      "title": "System Field Inspector",
      "summary": "Select any node to edit titles, ids, validation rules, and computed formulas.",
      "details": [
        "Inspector controls update the reactive system state; changes mark the draft dirty and emit status messages.",
        "The inspector honours tier restrictions—creator tier is required to persist systems to the server.",
        "Computed expressions use the shared formula engine so templates and characters evaluate the same syntax."],
      "category": "System Editor",
      "href": "docs/index.html#system-inspector"
    },
    {
      "id": "system.picker",
      "title": "Active System Picker",
      "summary": "Select an existing saved System from the server, create a New System, or Duplicate an existing System to create something new but similar.",
      "details": [
        "The content registry module checks the local cache, validates checksums, and flags missing assets in the UI.",
        "Use the \"New System\" modal to clone a builtin into your workspace with a custom id and version tag.",
        "When a builtin asset is temporarily unavailable, a status badge surfaces the outage without blocking other work."],
      "category": "System Editor",
      "href": "docs/index.html#system-builtins"
    },
    {
      "id": "template.library",
      "title": "Template Component Library",
      "summary": "Arrange reusable components—sections, inputs, tracks, notes—by dragging them from the component pane.",
      "details": [
        "Component definitions share icon metadata from `COMPONENT_ICONS` so they stay consistent across tools.",
        "Dropping a component hydrates default styles, labels, and bindings that can be refined in the properties panel.",
        "Repeaters and groups retain nested child components and expose quick actions for duplication or removal."],
      "category": "Template Builder",
      "href": "docs/index.html#template-library"
    },
    {
      "id": "template.properties",
      "title": "Template Properties Panel",
      "summary": "Configure binding targets, layout rules, and conditional visibility for each component.",
      "details": [
        "Properties sync bidirectionally: editing inputs updates the live canvas immediately and records an undo snapshot.",
        "Binding pickers are populated from the active system schema via the shared `component-data` helpers.",
        "Advanced sections toggle formatting, colour accents, and responsive behaviour without custom CSS."],
      "category": "Template Builder",
      "href": "docs/index.html#template-properties"
    },
    {
      "id": "character.records",
      "title": "Character Record Lifecycle",
      "summary": "Load templates, capture values, and maintain offline drafts before syncing to the server.",
      "details": [
        "When a template is selected the renderer builds component trees, preserving persistent ids for diffing and undo.",
        "Local drafts are saved in IndexedDB/localStorage namespaces scoped by the current authenticated user.",
        "Saving pushes the draft to the API with ownership metadata so access tiers and share permissions stay intact."],
      "category": "Character Sheet",
      "href": "docs/index.html#character-records"
    },
    {
      "id": "character.dice",
      "title": "Dice Roller & Formulas",
      "summary": "Inline dice expressions evaluate with the shared roller and formula engine.",
      "details": [
        "Use `/roll 2d6+3` in notes or click quick dice buttons to push results to the game log pane.",
        "Component formulas resolve bindings through the same evaluation pipeline as the system editor.",
        "Roll history persists per-session so the log survives page reloads during an active play session."],
      "category": "Character Sheet",
      "href": "docs/index.html#character-dice"
    },
    {
      "id": "collaboration.shares",
      "title": "Sharing & Collaboration",
      "summary": "Grant access via direct shares, reusable share links, or campaign groups.",
      "details": [
        "The server enforces owner/admin checks before creating shares. Eligible users are filtered by tier and existing permissions.",
        "Share links carry randomly generated tokens stored alongside the content id; access is logged for auditing.",
        "Campaign groups bind characters to a shared log so dice rolls and notes broadcast to every participant."],
      "category": "Collaboration",
      "href": "docs/index.html#collaboration-shares"
    },
    {
      "id": "accounts.roles",
      "title": "Account Tiers & Access Gates",
      "summary": "Feature availability is driven by user tier with graceful fallbacks for anonymous users.",
      "details": [
        "Tier metadata comes from the session token; anonymous users operate in read-only mode with local drafts only.",
        "Tier gates wrap tool content and automatically reload once a user upgrades or downgrades permissions.",
        "Visual badges communicate when an action (like publishing a template) requires elevated privileges."],
      "category": "Collaboration",
      "href": "docs/index.html#accounts-roles"
    },
    {
      "id": "press.flow",
      "title": "Press Source → Template Flow",
      "summary": "Press keeps the shared three-step flow: pick a source, map it to a template, then lock size and orientation.",
      "details": [
        "Selections now live at the top of the right pane so source, template, size, and orientation are visible while previewing.",
        "Tooltips use the shared Workbench help system; click the (?) badges to open full docs without cluttering the canvas.",
        "Overlays stay enabled by default so trim and safe areas stay visible in both preview and print stacks."],
      "category": "Press",
      "href": "../press/index.html#press-flow"
    },
    {
      "id": "press.selection",
      "title": "Selections Panel",
      "summary": "Collapse or expand the selections card with the chevron toggle to reclaim space on smaller screens.",
      "details": [
        "The Source, URL/ID, Template, Size, and Orientation inputs share the right-pane card under a collapsible header.",
        "Help badges next to the heading and Template label surface guidance without repeating copy in the layout.",
        "Selections refresh the preview, JSON payload, and print stack immediately after each change."],
      "category": "Press",
      "href": "../press/index.html#press-selection"
    },
    {
      "id": "press.source.ddb",
      "title": "D&D Beyond URLs & IDs",
      "summary": "Paste a D&D Beyond URL or ID; the value stays local while building your print job.",
      "details": [
        "Use an official or homebrew URL/ID; content stays in the browser for layout mapping.",
        "You can paste a full URL or the numeric/slug ID from D&D Beyond; Workbench reads it locally for layout mapping.",
        "Use share links when possible to avoid permissions issues while you preview cards or sheets.",
        "Hover or tap the (?) badge next to Source when D&D Beyond is selected to see these notes without extra inline copy."],
      "category": "Press",
      "href": "../press/index.html#press-selection"
    },
    {
      "id": "press.source.srd",
      "title": "5e SRD Endpoints",
      "summary": "Use SRD API slugs to prefill previews from the open 5e reference without auth.",
      "details": [
        "Paste a slug such as `/api/spells/acid-arrow` or `/api/monsters/aboleth` to pull SRD data.",
        "Requests stay client-side; nothing is sent to the server beyond the SRD fetch.",
        "Pair SRD payloads with templates and sizes in the selections card to see print-ready previews."
      ],
      "category": "Press",
      "href": "../press/index.html#press-selection"
    },
    {
      "id": "press.source.json",
      "title": "Local JSON Uploads",
      "summary": "Load a JSON file directly from your device; it remains local for preview and print.",
      "details": [
        "Choose a `.json` file; the contents are read in the browser and not uploaded anywhere.",
        "After selecting a template, map fields as needed so the preview reflects your layout.",
        "Re-upload to refresh changes; the selections card updates the JSON preview when expanded."
      ],
      "category": "Press",
      "href": "../press/index.html#press-selection"
    },
    {
      "id": "press.source.manual",
      "title": "Manual Entry Notes",
      "summary": "Type quick copy for ad-hoc cards or tests without connecting to an external source.",
      "details": [
        "Use this field for one-off notes, reminders, or draft text before wiring a source integration.",
        "Content is stored in-page only; refresh clears it unless you save elsewhere.",
        "Pair manual notes with any template, size, and orientation to see how they will print."
      ],
      "category": "Press",
      "href": "../press/index.html#press-selection"
    },
    {
      "id": "press.templates",
      "title": "Template & Size Pairing",
      "summary": "Template choices drive supported sizes and orientations, which auto-refresh when the template changes.",
      "details": [
        "Format and orientation dropdowns sit on their own rows so each choice stays visible while you scroll other inputs.",
        "Selection badges above the preview mirror your active template, size, orientation, and side for quick checks.",
        "Changing templates resets the size and orientation dropdowns before rebuilding the preview and print stack."],
      "category": "Press",
      "href": "../press/index.html#press-templates"
    },
    {
      "id": "press.size",
      "title": "Selecting Print Size",
      "summary": "Size options come from the chosen template; pick the paper size that matches your stock.",
      "details": [
        "Templates surface only supported sizes; switching templates refreshes this list automatically.",
        "Use the badges above the preview to confirm the active size before printing.",
        "Card templates factor in gutters and margins when calculating the printable grid for each size."
      ],
      "category": "Press",
      "href": "../press/index.html#press-templates"
    },
    {
      "id": "press.orientation",
      "title": "Choosing Orientation",
      "summary": "Orientation defaults to the template recommendation but can be changed per format.",
      "details": [
        "Orientation options depend on the selected size; some formats may offer only portrait or landscape.",
        "Switching orientation rebuilds the preview and print stack to fit the new layout.",
        "Trim and safe overlays adjust automatically so you can validate margins before printing."
      ],
      "category": "Press",
      "href": "../press/index.html#press-templates"
    },
    {
      "id": "press.palette",
      "title": "Press Palette Placeholder",
      "summary": "A shared palette will land in the left pane so Workbench and Press reuse the same draggable assets.",
      "details": [
        "The left card reserves space for the future palette; the help badge links to the roadmap while we wire it up.",
        "Until the palette arrives, make selections from the right-pane card to feed the preview and print stack.",
        "Palette content will be shared via /common so other tools can reuse the same modules without duplication."],
      "category": "Press",
      "href": "../press/index.html#press-palette"
    },
    {
      "id": "press.printing",
      "title": "Alignment & Print Prep",
      "summary": "Follow the four-step alignment checklist before printing cards, notecards, or sheets.",
      "details": [
        "Overlays stay visible in preview and print; measure the 0.25in margins and confirm cut lines align across sides.",
        "Verify that dashed safe areas stay inside the inset guides and run a test sheet before bulk jobs.",
        "Use system print dialogs with 100% scaling and flip on the long edge for duplex output."],
      "category": "Press",
      "href": "../press/index.html#press-printing"
    }
  ]
}
