cards = [
	{
		"index": "prismatic-geode",
		"name": "Prismatic Geode",
		"image": "https://wrightmat.github.io/obsidian/img/prismatic-geode.png",
		"description": "<p>This split geode shimmers with a rainbow of colors. Most attuned to the arcane forces of nature can tell at just a glance that it radiates power untold.</p><p><b>Elemental Affinity</b>. While attuned to this magic item, after completing a long rest, you gain resistance to a damage type of your choosing from this list: Acid, Fire, Cold, Lightning, Force, or Radiant. After each long rest, you can cycle to a different resistance.</p><p><b>Charges</b>. The geode has 20 charges for the following properties. The geode regains 2d8 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the geode shatters.</p><p><b>Spells</b>. While holding this geode, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, with a spell save DC of 18 and spell attack bonus of +10: cone of cold (5 charges), fireball (5th-level version, 5 charges), prismatic spray (7 charges), wall of light (5 charges), prismatic wall (9 charges). lightning bolt (5th-level version, 5 charges), pulse wave (3 charge), Melf's Acid Arrows (2 charge), or wall of force (5 charges).</p>",
		"type": "Wondrous Item",
		"rarity": "Legendary",
		"attunement": "true",
		"notes": ""
	},
	{
		"index": "totem-bear-totem",
		"name": "Totem of the Bear Totem",
		"image": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/59c46321-f346-4707-af69-a59f1115d95d/d9rmzuh-e3a2ea19-806e-4bbd-a4e1-d9099b9ef935.png?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzU5YzQ2MzIxLWYzNDYtNDcwNy1hZjY5LWE1OWYxMTE1ZDk1ZFwvZDlybXp1aC1lM2EyZWExOS04MDZlLTRiYmQtYTRlMS1kOTA5OWI5ZWY5MzUucG5nIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.oB_xILRywIFAJ793sWswRnBWRXX6F0iQpCHbN2XbXxc",
		"description": "<p>This wooden totem, carved in the shape of the Bear Totem Ursix, houses his essence as the representative of Balinor in the Three Faces of the Wild.</p><p>Once per day, while raging, you have resistance to all damage except psychic damage. The spirit of the bear makes you tough enough to stand up to any punishment.</p><p>Use of this totem resets after a Long Rest.</p>",
		"type": "Wondrous Item",
		"rarity": "Uncommon",
		"attunement": "false",
		"notes": "Barbarian, Combat"
	},
	{
		"index": "amulet-black-skull",
		"name": "Amulet of the Black Skull",
		"image": "https://external-preview.redd.it/amulet-of-the-black-skull-according-to-midjourney-v0-xQv0zuwfTlGbRQ7-oLOReW6dr8JlxCbVl0tFmXAGZeY.jpg?auto=webp&s=24932a77e44b3a721eb34cc3242da064fe4f8be1",
		"description": "<p>This amulet is carved from obsidian and shaped like a screaming humanoid skull, with ruby eyes and opals for teeth. It hangs from an iron chain necklace.</p><p>The amulet has 6 charges and regains ld6 charges daily at dawn. While wearing the amulet, you can use an action to expend 1 of its charges to transport yourself and anything you are wearing or carrying to a location within 100 feet of you. The destination you choose doesn't need to be in your line of sight, but it must be familiar to you (in other words, a place you have seen or visited), and it must be on the same plane of existence as you.</p><p>If you aren't undead, you must make a DC 16 Constitution saving throw each time you use the amulet to teleport. On a failed saving throw, the black skull cackles as you are transformed in transit. The transformation takes effect as soon as you arrive at the destination, and is determined randomly by rolling percentile dice and consulting the Black Skull Transformation table.</p>",
		"type": "Wondrous Item",
		"rarity": "Very Rare",
		"attunement": "true",
		"notes": ""
	},
	{
		"index": "banner-eternal-battlefield",
		"name": "Banner of the Eternal Battlefield",
		"image": "https://www.dmsguild.com/images/8957/_product_images/388514/shavarath_(copy).png",
		"description": "<p>Crafted from a thick, red fabric, this banner measures 5 feet high and 3 feet wide. The rune of Shavarath is displayed on the fabric with round, metal plates sewn into it. It can be attached to a 10-foot pole to serve as a standard. Furling or unfurling the banner requires an action. The banner has the following properties.</p><p><b>Mark of Courage</b>. As a bonus action, you can touch the unfurled banner and cause it to emanate courage. You and your allies are immune to the frightened condition while within 20 feet of it. This benefit lasts for 10 minutes or until the banner is furled. Once you use this property, you can't use it again until you finish a short or long rest.</p><p><b>Sentinel Standard</b>. You can see invisible creatures while they are within 20 feet of the unfurled banner and within your line of sight.</p><p><b>Standard's Shield</b>. As a bonus action, you can touch the unfurled banner and invoke this power. Any ranged attack roll that targets you or an ally of yours has disadvantage if the target is within 20 feet of the unfurled banner. This benefit lasts for 1 minute or until the banner is furled. Once you use this property, you can't use it again until you finish a short or long rest.</p>",
		"type": "Wondrous Item",
		"rarity": "Rare",
		"attunement": "true",
		"notes": ""
	}
]
cards['wondrous'] = [ "prismatic-geode", "totem-bear-totem", "amulet-black-skull", "banner-eternal-battlefield" ]
cards['common'] = [ ]
cards['uncommon'] = [ "totem-bear-totem" ]
cards['rare'] = [ "banner-eternal-battlefield" ]
cards['very-rare'] = [ "amulet-black-skull" ]
cards['legendary'] = [ "prismatic-geode" ]
